tap "drgrib/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "netlify/netlifyctl"
tap "osx-cross/avr"
tap "px4/px4"
tap "sanemat/font"
tap "shopify/shopify"
# All in one for **env
brew "anyenv"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Atmel AVR MCU programmer
brew "avrdude"
# Library for command-line editing
brew "readline"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Dependency Manager for PHP
brew "composer"
# Filename encoding conversion tool
brew "convmv"
# Device firmware update based USB programmer for Atmel chips
brew "dfu-programmer"
# USB programmer
brew "dfu-util"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Distributed revision control system
brew "git"
# Powerful, lightweight programming language
brew "lua"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Utility for creating and opening lzh archives
brew "lha"
# Conversion library
brew "libiconv"
# High performance, distributed memory object caching system
brew "memcached"
# C and C++ client library to the memcached server
brew "libmemcached"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Keep your Mac's application settings in sync
brew "mackup"
# Mac App Store command-line interface
brew "mas"
# Open source relational database management system
brew "mysql"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Command-line tool to generate, analyze, convert and manipulate colors
brew "pastel"
# Manage compile and link flags for libraries
brew "pkg-config"
# Implementation of Telnet and SSH
brew "putty"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Utility that provides fast incremental file transfer
brew "rsync"
# Command-line tool for the Amazon S3 service
brew "s3cmd"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Extract, view, and test RAR archives
brew "unrar"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# General-purpose lossless data-compression library
brew "zlib"
# 
brew "drgrib/tap/ttimer"
# CLI to interact with netlify.com
brew "netlify/netlifyctl/netlifyctl"
# GNU compiler collection for AVR 8-bit and 32-bit Microcontrollers
brew "osx-cross/avr/avr-gcc@7"
# GNU compiler collection for AVR 8-bit and 32-bit Microcontrollers
brew "osx-cross/avr/avr-gcc@8", link: true
# GNU Embedded Toolchain for ARM
brew "px4/px4/gcc-arm-none-eabi"
# Font for programming
brew "sanemat/font/ricty"
# Theme Kit is a tool kit for manipulating shopify themes
brew "shopify/shopify/themekit"
cask "1password"
cask "alfred"
cask "appcleaner"
cask "atom"
cask "brackets"
cask "calibre"
cask "charles"
cask "cheatsheet"
cask "cyberduck"
cask "dash"
cask "docker"
cask "dropbox"
cask "duet"
cask "evernote"
cask "fantastical"
cask "figma"
cask "firefox"
cask "github"
cask "google-backup-and-sync"
cask "google-chrome"
cask "google-chrome-canary"
cask "hyperswitch"
cask "imageoptim"
cask "istat-menus"
cask "jasper"
cask "karabiner-elements"
cask "kindle"
cask "lepton"
cask "linear"
cask "mamp"
cask "mapture"
cask "messenger"
cask "notion"
cask "numi"
cask "omnifocus"
cask "paw"
cask "runjs"
cask "safari-technology-preview"
cask "sequel-pro"
cask "sketch"
cask "skype"
cask "slack"
cask "sneek"
cask "sourcetree"
cask "spotify"
cask "sublime-merge"
cask "sublime-text"
cask "taskpaper"
cask "teamviewer"
cask "tower"
cask "transmit"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
mas "Airmail", id: 918858936
mas "AirSketch", id: 1286744480
mas "Be Focused", id: 973134470
mas "BetterSnapTool", id: 417375580
mas "CotEditor", id: 1024640650
mas "Focus", id: 777233759
mas "GarageBand", id: 682658836
mas "Hidden Bar", id: 1452453066
mas "iA Writer", id: 775737590
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Micro Sniff", id: 1504024265
mas "MindNode", id: 1289197285
mas "Momentum", id: 1030442215
mas "Monosnap", id: 540348655
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PopClip", id: 445189367
mas "Proxy", id: 874920950
mas "Quiver", id: 866773894
mas "Shotty", id: 1250306151
mas "The Unarchiver", id: 425424353
mas "Todoist", id: 585829637
mas "Twitter", id: 409789998
mas "WinArchiver Lite", id: 414855915
mas "Wunderlist", id: 410628904
mas "Xcode", id: 497799835
