tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "sanemat/font"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Library for command-line editing
brew "readline"
# Official Amazon AWS command-line interface
brew "awscli"
# Dependency Manager for PHP
brew "composer"
# Filename encoding conversion tool
brew "convmv"
# Distributed revision control system
brew "git"
# Powerful, lightweight programming language
brew "lua"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Utility for creating and opening lzh archives
brew "lha"
# High performance, distributed memory object caching system
brew "memcached"
# C and C++ client library to the memcached server
brew "libmemcached"
# Keep your Mac's application settings in sync
brew "mackup"
# Mac App Store command-line interface
brew "mas"
# Open source relational database management system
brew "mysql"
# Node.js version manager
brew "nodebrew"
# Manage compile and link flags for libraries
brew "pkg-config"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Command-line tool for the Amazon S3 service
brew "s3cmd"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Font for programming
brew "sanemat/font/ricty"
cask "1password"
cask "alfred"
cask "appcleaner"
cask "atom"
cask "brackets"
cask "calibre"
cask "charles"
cask "cheatsheet"
cask "cyberduck"
cask "dash"
cask "docker"
cask "dropbox"
cask "duet"
cask "evernote"
cask "fantastical"
cask "firefox"
cask "github"
cask "google-backup-and-sync"
cask "google-chrome"
cask "google-chrome-canary"
cask "hyperswitch"
cask "imageoptim"
cask "istat-menus"
cask "karabiner-elements"
cask "kindle"
cask "lepton"
cask "linear"
cask "mamp"
cask "mapture"
cask "messenger"
cask "notion"
cask "omnifocus"
cask "paw"
cask "sequel-pro"
cask "sketch"
cask "skype"
cask "slack"
cask "sourcetree"
cask "spotify"
cask "sublime-text"
cask "tower"
cask "transmit"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
mas "Airmail 3", id: 918858936
mas "AirSketch", id: 1286744480
mas "Be Focused", id: 973134470
mas "BetterSnapTool", id: 417375580
mas "CotEditor", id: 1024640650
mas "GarageBand", id: 682658836
mas "iA Writer", id: 775737590
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "MindNode", id: 1289197285
mas "Momentum", id: 1030442215
mas "Monosnap", id: 540348655
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PopClip", id: 445189367
mas "Proxy", id: 874920950
mas "Quiver", id: 866773894
mas "Shotty", id: 1250306151
mas "The Unarchiver", id: 425424353
mas "Todoist", id: 585829637
mas "Twitter", id: 409789998
mas "WinArchiver Lite", id: 414855915
mas "Wunderlist", id: 410628904
mas "Xcode", id: 497799835
